Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/shortcuts-omegat.tmx
Source language: en_us
Languages: pt_br

source: Finding, Searching, and Replacing
pt_br: Procurando, pesquisando e substituindo

source: Search word at insert point
pt_br: Pesquisar palavra no ponto atual

source: Find next/previous in file
pt_br: Procurar próximo/anterior no arquivo

source: Find/Replace in file
pt_br: Procurar/substituir no arquivo

source: Find usages
pt_br: Procurar utilizações

source: Find/replace in projects
pt_br: Procurar/substituir no projeto

source: Find usages results
pt_br: Resultados da procura de utilizações

source: Turn off search result highlights
pt_br: Desativar realce em pesquisas

source: Rename
pt_br: Renomear

source: Ctrl-U, then U
pt_br: Ctrl-U, então U

source: Convert selection to uppercase
pt_br: Converter seleção para maiúsculas

source: Ctrl-U, then L
pt_br: Ctrl-U, então L

source: Convert selection to lowercase
pt_br: Converter seleção para minúsculas

source: Ctrl-U, then S
pt_br: Ctrl-U, então S

source: Toggle case of selection
pt_br: Alternar entre maiúsculas/minúsculas

source: Alt-Shift-V
pt_br: Ctrl-Shift-V

source: Paste formatted
pt_br: Colar formatado

source: Navigating through Source Code
pt_br: Navegando através do código-fonte

source: Go to type/file
pt_br: Ir para tipo/arquivo

source: Go to JUnit test
pt_br: Ir para teste JUnit

source: Go to source
pt_br: Ir para código-fonte

source: Go to declaration
pt_br: Ir para declaração

source: Go to line
pt_br: Ir para linha

source: Toggle add/remove bookmark
pt_br: Alternar entre adicionar/remover marcador

source: Ctrl-Shift-Period/Comma
pt_br: Ctrl-Shift-ponto/vírgula

source: Next/previous bookmark
pt_br: Marcador próximo/anterior

source: Ctrl-Period/Comma
pt_br: Ctrl-ponto/vírgula

source: Next/previous usage/compile error
pt_br: Próx./Ant. erro de uso/compilação

source: Select in Projects/Files/Favorites
pt_br: Selecionar em Proj./Arq./Favoritos

source: Move caret to matching bracket
pt_br: Mover para parêntese correspondente

source: Next/previous word match
pt_br: Próx./ant. palavra correspondente

source: Go backward/forward/to last edit
pt_br: Ir para a edição ant./próx./última

source: Coding in Java
pt_br: Codificando em Java

source: Generate code
pt_br: Gerar código

source: Fix all class imports
pt_br: Corrigir todas as importações da classe

source: Fix selected class's import
pt_br: Corrigir a importação da classe selecionada

source: Format selection
pt_br: Formatar seleção

source: Alt-Shift Left/
pt_br: Alt-Shift Esq./

source: Right/Up/Down
pt_br: Direita/Para cima/Para baixo

source: Shift lines left/right/up/down
pt_br: Mover linhas para esquerda/direita/cima/baixo

source: Ctrl-Shift-Up/D
pt_br: Ctrl-Shift-Cima/D

source: Copy lines up/down
pt_br: Copiar linhas para cima/baixo

source: Inspect members/hierarchy
pt_br: Inspecionar membros/hierarquia

source: Add/remove comment lines
pt_br: Adicionar/remover comentário das linhas

source: Delete current line
pt_br: Excluir a linha atual

source: Coding in C/C++
pt_br: Codificando em C/C++

source: Evaluate expression
pt_br: Avaliar expressão

source: Coding in Ruby
pt_br: Codificando em Ruby

source: Jump Rails action > view
pt_br: Pular ação Rails > visualização

source: Alt-Shift-Period/Comma
pt_br: Alt-Shift-ponto/vírgula

source: Select Next/Previous element
pt_br: Selecionar próximo/anterior elemento

source: Ctrl-Shift-Space
pt_br: Ctrl-Shift-Espaço

source: Show documentation
pt_br: Exibir documentação

source: Jump from test file to file
pt_br: Ir do arquivo de teste para o arquivo

source: Tab-Shift-Arrows
pt_br: Tab-Shift-Setas

source: Move through elements
pt_br: Mover através dos elementos

source: Advanced search
pt_br: Busca avançada

source: Expand/collapse elements
pt_br: Expandir/contrair elementos

source: Show BPEL Mapper
pt_br: Exibir BPEL Mapper

source: Insert attribute/operation into selected element
pt_br: Inserir atributo/operação no elemento selecionado

source: Fit diagram into window
pt_br: Ajustar diagrama à janela

source: Toggle Overview window
pt_br: Alternar janela de Visão geral

source: Select active UML diagram
pt_br: Selecionar o diagrama UML ativo

source: Compiling, Testing, and Running
pt_br: Compilação, testes e execução

source: Compile package/ file
pt_br: Compilar pacote/file

source: Build main project
pt_br: Construir projeto principal

source: Clean & build main project
pt_br: Limpar e construir projeto principal

source: Set request parameters
pt_br: Definir parâmetros de requisição

source: Create JUnit test
pt_br: Criar testes JUnit

source: Run JUnit test on file/project
pt_br: Executar testes JUnit no arquivo/projeto

source: Run main project/file
pt_br: Executar projeto principal/arquivo

source: Opening and Toggling between Views
pt_br: Abrindo e alternando entre visualizações

source: Toggle between open documents
pt_br: Alternar entre documentos abertos

source: Maximize window (toggle)
pt_br: Maximizar janela (alternar)

source: Close currently selected window
pt_br: Fechar a janela selecionada

source: Close all windows
pt_br: Fechar todas as janelas

source: Open contextual menu
pt_br: Abrir menu contextual

source: Undock window
pt_br: Desacoplar janela

source: debug
pt_br: depurar

source: Debugging
pt_br: Depuração

source: Start debugging main project
pt_br: Inicializar depuração do projeto principal

source: Start debugging current file
pt_br: Inicializar depuração do arquivo corrente

source: Start debugging test for file (JUnit)
pt_br: Inicializar depuração do teste para o arquivo (JUnit)

source: Stop/Continue debugging session
pt_br: Parar/Continuar a sessão de depuração

source: Run to cursor location in file
pt_br: Executar até a localização do cursor no arquivo

source: Step into/over
pt_br: Passar dentro/sobre

source: Step out
pt_br: Passar fora

source: Ctrl-Alt-Up
pt_br: Ctrl-Alt-Cima

source: Go to called method
pt_br: Ir para o método chamado

source: Ctrl-Alt-Down
pt_br: Ctrl-Alt-Baixo

source: Go to calling method
pt_br: Ir para o método invocador

source: Toggle breakpoint
pt_br: Alternar ponto de interrupção

source: New breakpoint
pt_br: Novo ponto de interrupção

source: New watch
pt_br: Novo observador

source: When typing in the Source Editor, you can generate the text in the right-column of the following list by typing the abbreviation that is listed in the left-column and then pressing Tab.
pt_br: Quando digitando no Editor de código-fonte, é possível gerar o texto da coluna da direita da lista abaixo apenas digitando a abreviação da coluna correspondente e então pressionar Tab.

source: Java Editor Code Templates
pt_br: Modelos de código para editor Java

source: JSP Editor Code Templates
pt_br: Modelos de código para editor JSP

source: To Change Default Settings:
pt_br: Para alterar as configurações padrões:

source: Choose Tools > Options from the main menu.
pt_br: Escolha Ferramentas > Opções no menu principal

source: For code templates, select Editor and click the Code Templates tab.
pt_br: Para modelos de código, selecione Editor e clique na aba Modelos de código.

source: Here you can also change the expansion key, from Tab to something else.
pt_br: Aqui você ainda pode alterar a tecla de expansão, de Tab para outra tecla.

source: For keyboard shortcuts, select Keymap and choose a profile from the Profile drop-down list.
pt_br: Para atalhos de teclados, selecione Mapa de teclas e selecione o perfil a partir da lista Perfis.

source: Complete List of Keyboard Shortcuts:
pt_br: Lista completa de atalhos de teclado:

source: Highlights of NetBeans IDE 6.0 Keyboard Shortcuts & Code Templates
pt_br: Destaques entre os atalhos de teclado & modelos de código do NetBeans 6.0

source: Gj Wielenga
pt_br: Michel Graciano

source: en-US
pt_br: pt-BR
